# Taps
tap "homebrew/cask-fonts"

# terminal applications
brew "exa"	# Modern replacement for ls
brew "ffmpeg"	# Multipurpose video & audio util
brew "mas"	# MacOS App Store CLI
brew "youtube-dl"	# Download videos

# Programming utils
brew "pyenv"	# Python version manager
brew "nvm"	# Node Version Manager
brew "gh"	# GitHub CLI

cask "adguard"
cask "adobe-creative-cloud"
cask "1password"
cask "appcleaner"
cask "bartender"
cask "keka"
cask "daisydisk"
cask "dockey"
cask "cleanshot"
cask "discord"
cask "fantastical"
cask "figma"
cask "notion"
cask "sensei"
cask "slack"
cask "google-chrome"
cask "iina"
cask "iterm2"
cask "pixelsnap"
cask "microsoft-teams"
cask "rectangle"
cask "sip"
cask "spotify"
cask "warp"
cask "swish"
cask "transmission"
cask "visual-studio-code"
cask "zoom"

# Fonts
cask "font-jetbrains-mono"

# App Store
mas "1Password for Safari", id: 1569813296
mas "Compressor", id: 424390742
mas "Craft", id: 1487937127
mas "Fantastical", id: 975937182
mas "Final Cut Pro", id: 424389933
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Notability", id: 360593530
mas "OneDrive", id: 823766827
mas "QR Factory", id: 1609285899
mas "Todoist", id: 585829637